alibaba/AliOS-Things/platform/mcu/cy8c6347/Generated_Source/PSoC6/pdl/devices/psoc6/psoc63/include/cy_device_headers.h
/***************************************************************************//**
* \file cy_device_headers.h
*
* \brief
* Common header file to be included by the drivers.
*
* \note
* Generator version: 1.2.0.117
* Database revision: rev#1057352
*
********************************************************************************
* \copyright
* Copyright 2016-2018, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CY_DEVICE_HEADERS_H_
#define _CY_DEVICE_HEADERS_H_

#if defined (CY8C6336BZI_BLF03)
    #include "cy8c6336bzi_blf03.h"
#elif defined (CY8C6316BZI_BLF03)
    #include "cy8c6316bzi_blf03.h"
#elif defined (CY8C6316BZI_BLF53)
    #include "cy8c6316bzi_blf53.h"
#elif defined (CY8C6336BZI_BLD13)
    #include "cy8c6336bzi_bld13.h"
#elif defined (CY8C6347BZI_BLD43)
    #include "cy8c6347bzi_bld43.h"
#elif defined (CY8C6347BZI_BLD33)
    #include "cy8c6347bzi_bld33.h"
#elif defined (CY8C6347BZI_BLD53)
    #include "cy8c6347bzi_bld53.h"
#elif defined (CY8C6347FMI_BLD13)
    #include "cy8c6347fmi_bld13.h"
#elif defined (CY8C6347FMI_BLD43)
    #include "cy8c6347fmi_bld43.h"
#elif defined (CY8C6347FMI_BLD33)
    #include "cy8c6347fmi_bld33.h"
#elif defined (CY8C6347FMI_BLD53)
    #include "cy8c6347fmi_bld53.h"
#elif defined (CY8C637BZI_MD76)
    #include "cy8c637bzi_md76.h"
#elif defined (CY8C637BZI_BLD74)
    #include "cy8c637bzi_bld74.h"
#elif defined (CY8C637FMI_BLD73)
    #include "cy8c637fmi_bld73.h"
#elif defined (CY8C68237BZ_BLE)
    #include "cy8c68237bz_ble.h"
#elif defined (CY8C68237FM_BLE)
    #include "cy8c68237fm_ble.h"
#elif defined (CY8C6336BZI_BUD13)
    #include "cy8c6336bzi_bud13.h"
#elif defined (CY8C6347BZI_BUD43)
    #include "cy8c6347bzi_bud43.h"
#elif defined (CY8C6347BZI_BUD33)
    #include "cy8c6347bzi_bud33.h"
#elif defined (CY8C6347BZI_BUD53)
    #include "cy8c6347bzi_bud53.h"
#elif defined (CY8C6337BZI_BLF13)
    #include "cy8c6337bzi_blf13.h"
#elif defined (CY8C6336BZI_BLF04)
    #include "cy8c6336bzi_blf04.h"
#elif defined (CY8C6316BZI_BLF04)
    #include "cy8c6316bzi_blf04.h"
#elif defined (CY8C6316BZI_BLF54)
    #include "cy8c6316bzi_blf54.h"
#elif defined (CY8C6336BZI_BLD14)
    #include "cy8c6336bzi_bld14.h"
#elif defined (CY8C6347BZI_BLD44)
    #include "cy8c6347bzi_bld44.h"
#elif defined (CY8C6347BZI_BLD34)
    #include "cy8c6347bzi_bld34.h"
#elif defined (CY8C6347BZI_BLD54)
    #include "cy8c6347bzi_bld54.h"
#elif defined (CYBLE_416045_02)
    #include "cyble_416045_02.h"
#else
    #error Undefined part number
#endif

#endif /* _CY_DEVICE_HEADERS_H_ */


/* [] END OF FILE */
